app/controllers/application_controller.rb

  def play

    chains_in_play = []

    Chain.all.each do |chain|

      if chain.posts.length <= 11
---
SELECT * FROM `chains`
SELECT * FROM `posts` WHERE (`posts`.chain_id = 3)