app/controllers/chains_controller.rb

SELECT * FROM `chains`
---
  def index
    @chains = Chain.all

SELECT * FROM `chains` WHERE (`chains`.`id` = 1)
---
  def show

    @chain = Chain.find(params[:id])

INSERT INTO `chains` (`updated_at`, `title`, `post_length`, `created_at`) VALUES('2010-09-21 16:57:56', 'First Thread yay!', 20, '2010-09-21 16:57:56')
INSERT INTO `posts` (`image_file_size`, `updated_at`, `text`, `image_content_type`, `flagged`, `chain_id`, `user_id`, `previous_post`, `image_updated_at`, `created_at`, `image_file_name`) VALUES(NULL, '2010-09-24 00:33:25', 'Chairs for sale!', NULL, NULL, 9, NULL, NULL, NULL, '2010-09-24 00:33:25', NULL)
---
  def create
     @chain = Chain.new(params[:chain])

     respond_to do |format|
       if @chain.save
         @post = Post.new({:text => @chain.title, :chain_id => @chain.id})
         if @post.save

SELECT * FROM `chains` WHERE (`chains`.`id` = 2)
SELECT * FROM `posts` WHERE (`posts`.chain_id = 3)
DELETE FROM `posts` WHERE `id` = 62
DELETE FROM `chains` WHERE `id` = 2
---
  def destroy
     @chain = Chain.find(params[:id])

     @chain.posts.each do |post|
       post.destroy
     end

     @chain.destroy