app/controllers/posts_controller.rb

SELECT * FROM `posts`
---
  def index
    @posts = Post.all

SELECT * FROM `chains` WHERE (`chains`.`id` = 1)
---
  def new
    @post = Post.new
    @chain = Chain.find(params[:chain])

SELECT * FROM `posts` WHERE (`posts`.`id` = 78)
UPDATE `posts` SET `flagged` = 1, `updated_at` = '2010-09-24 00:02:09' WHERE `id` = 78
---
  def flag

    @post = Post.find(params[:id])

    flagged = 0

    if !@post.flagged

      flagged = 1

    else

      flagged = @post.flagged + 1

    end

    respond_to do |format|
      if @post.update_attributes( :flagged => flagged )

SELECT * FROM `posts` WHERE (`posts`.chain_id = 3) ORDER BY posts.id DESC LIMIT 1
INSERT INTO `posts` (`image_file_size`, `updated_at`, `text`, `image_content_type`, `chain_id`, `user_id`, `previous_post`, `image_path`, `image_updated_at`, `created_at`, `image_file_name`) VALUES(4266, '2010-09-23 18:49:22', 'and some text', 'image/png', 3, NULL, 49, NULL, '2010-09-23 18:49:22', '2010-09-23 18:49:22', 'Picture 1.png')
---
  def create

    @post = Post.new(params[:post])
    @chain = @post.chain

    if @post.previous_post == @chain.posts.last.id

      respond_to do |format|
        if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1
---
  def destroy
     @post = Post.find(params[:id])
     @post.destroy